Tekla.Structures.ModelInternal.dotTemporaryState
//TODO

Tekla.Structures.ModelInternal.dotTemporaryState.OBJECT_MAX_SIZE
Maximum amount of elements in one function call

Tekla.Structures.ModelInternal.dotTemporaryState.GUID_LIST_MAX_SIZE
Maximum amount of guids in one function call

Tekla.Structures.ModelInternal.dotTemporaryState.SetState(Tekla.Structures.ModelInternal.dotTemporaryStatesEnum,Tekla.Structures.ModelInternal.dotTemporaryTransparenciesEnum)
Set state for all objects
State:
Transparency:
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.SetState(Tekla.Structures.ModelInternal.dotTemporaryStatesEnum)
Set state for all objects
Transparency is VISIBLE.
State:
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.SetState(Tekla.Structures.Model.ModelObject,Tekla.Structures.ModelInternal.dotTemporaryStatesEnum)
Set state for one object.
Transparency is VISIBLE.
MO:
State:
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.SetState(System.Collections.ArrayList,Tekla.Structures.ModelInternal.dotTemporaryStatesEnum,Tekla.Structures.ModelInternal.dotTemporaryTransparenciesEnum)
ModelObjects:
State:
Transparency:
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.SetState_FAST(System.Collections.ArrayList,Tekla.Structures.ModelInternal.dotTemporaryStatesEnum,Tekla.Structures.ModelInternal.dotTemporaryTransparenciesEnum)
ModelObjects:
State:
Transparency:
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.SetState_FAST(System.Collections.ArrayList,Tekla.Structures.ModelInternal.dotTemporaryStatesEnum)
ModelObjects:
State:
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.SetState_FAST(System.Collections.Generic.List{Tekla.Structures.Identifier},Tekla.Structures.ModelInternal.dotTemporaryStatesEnum,Tekla.Structures.ModelInternal.dotTemporaryTransparenciesEnum)
Identifiers:
State:
Transparency:
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.SetState_FAST(System.Collections.Generic.List{Tekla.Structures.Identifier},Tekla.Structures.ModelInternal.dotTemporaryStatesEnum)
Identifiers:
State:
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.SetState(System.Collections.ArrayList,Tekla.Structures.ModelInternal.dotTemporaryStatesEnum)
ModelObjects:
State:
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.SetState(Tekla.Structures.Model.UI.Color)
Set color for all objects
Color:
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.SetColor(Tekla.Structures.Model.ModelObject,Tekla.Structures.Model.UI.Color)
Set color for one object.
MO:
Color:
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.SetColor(System.Collections.ArrayList,Tekla.Structures.Model.UI.Color)
ModelObjects:
Color:
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.SetColor_FAST(System.Collections.ArrayList,Tekla.Structures.Model.UI.Color)
ModelObjects:
Color:
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.SetColor_FAST(System.Collections.Generic.List{Tekla.Structures.Identifier},Tekla.Structures.Model.UI.Color)
Identifiers:
Color:
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.GetTemporaryColor(Tekla.Structures.Model.ModelObject,Tekla.Structures.Model.UI.Color@)
Get temporary color for given object
MO:
Color:
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.GetAllTemporaryColored
Get all temporary colored objects and their color
Returns: Enumerable of Identifier-Color pairs

Tekla.Structures.ModelInternal.dotTemporaryState.ClearState(Tekla.Structures.Model.ModelObject)
MO:
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.ClearColor(Tekla.Structures.Model.ModelObject)
Clears the temporary color for a model object and keeps the transparency as before.
MO:
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.ClearAllStates
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.SetVisibiliy(System.Collections.Generic.List{Tekla.Structures.Model.ModelObject},System.Nullable{System.Boolean})
modelObjects:
Visibility:
Returns:

Tekla.Structures.ModelInternal.dotTemporaryState.UnhideParts
